# Напишите программу , в которолй пользователь будет задавать две строки 
# а программа будет определять количество  вхождений одной  строки в другую.

a = input('Введите первую строку :')
b = input('Введите вторую строку :')

print(a.count(b))
