# Дана строка,состоящая из слов,разделенных пробелом.
# Напишите программу ,которая подсчитает количество слов в этой строке.

a = 'Подсчет слов в строке'
res = len(a.split())
print("Здесь"" "+ str(res)+" ""слова")

# # Либо в одну строку 
# # 
# print(len(input().split()))